Fuentes/ficohsacore-vortex-7ebad6e8baaa/Middleware/v2/Resources/ConsultaRemesas/wsdl/consultaRemesasPS.wsdl

<wsdl:definitions name="consultaRemesasPS" targetNamespace="http://www.ficohsa.com.hn/middleware.services/consultaRemesasPS/" xmlns:fic="http://www.ficohsa.com.hn/middleware.services/consultaRemesasPS/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:auth="http://www.ficohsa.com.hn/middleware.services/autType" xmlns:cons="http://www.ficohsa.com.hn/middleware.services/consultaRemesasTypes">

	<wsdl:types>
		<xsd:schema>
			<xsd:import namespace="http://www.ficohsa.com.hn/middleware.services/autType" schemaLocation="../../esquemas_generales/HeaderElements.xsd"/>
		</xsd:schema>
		<xsd:schema>
			<xsd:import namespace="http://www.ficohsa.com.hn/middleware.services/consultaRemesasTypes" schemaLocation="../xsd/consultaRemesasTypes.xsd"/>
		</xsd:schema>
	</wsdl:types>

	<wsdl:message name="consultaRemesasRequest">
		<wsdl:part element="cons:consultaRemesas" name="parameters"/>
		<wsdl:part name="RequestHeader" element="auth:RequestHeader"/>
	</wsdl:message>
	<wsdl:message name="consultaRemesasResponse">
		<wsdl:part element="cons:consultaRemesasResponse" name="result"/>
		<wsdl:part name="ResponseHeader" element="auth:ResponseHeader"/>
	</wsdl:message>

	<wsdl:portType name="consultaRemesasPS">
		<wsdl:operation name="consultaRemesas" parameterOrder="parameters AutenticacionRequestHeader ResponseHeader">
			<wsdl:input message="fic:consultaRemesasRequest"/>
			<wsdl:output message="fic:consultaRemesasResponse"/>
		</wsdl:operation>
	</wsdl:portType>

	<wsdl:binding name="consultaRemesasPSSOAP" type="fic:consultaRemesasPS">
		<soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
		<wsdl:operation name="consultaRemesas">
			<soap:operation soapAction="http://www.ficohsa.com.hn/middleware.services/consultaRemesasPS/consultaRemesas"/>
			<wsdl:input>
				<soap:body use="literal" parts="parameters"/>
				<soap:header message="fic:consultaRemesasRequest" part="RequestHeader" use="literal"/>
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal" parts="result"/>
				<soap:header message="fic:consultaRemesasResponse" part="ResponseHeader" use="literal"/>
			</wsdl:output>
		</wsdl:operation>
	</wsdl:binding>

	<wsdl:service name="consultaRemesasPS">
		<wsdl:port binding="fic:consultaRemesasPSSOAP" name="consultaRemesasPSSOAP">
			<soap:address location="http://172.23.13.35:8003/Middleware/OperationsAndExecution/Payments/ConsultaRemesas"/>
		</wsdl:port>
	</wsdl:service>

</wsdl:definitions>